spec/cassettes/lock_account_on_payment_spec_failure/send_the_customer_an_email_informing_them_of_the_bad_transaction.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_16comgKUdRrCs1LrKlF6k8pb
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.20.1
      Authorization:
      - Bearer sk_test_aHOa6eoJJjnQPRDIPLzYaM70
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.20.1","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        source-11-xu 3.16.0-46-generic #62~14.04.1-Ubuntu SMP Tue Aug 11 16:27:16
        UTC 2015 x86_64 x86_64 x86_64 GNU/Linux"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 23 Aug 2015 04:07:06 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1993'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6qWo1KfpEFTfbG
      Stripe-Version:
      - '2015-07-28'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_16comgKUdRrCs1LrKlF6k8pb",
          "created": 1440299078,
          "livemode": false,
          "type": "charge.failed",
          "data": {
            "object": {
              "id": "ch_16comgKUdRrCs1Lr9jM7FUvO",
              "object": "charge",
              "created": 1440299078,
              "livemode": false,
              "paid": false,
              "status": "failed",
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "source": {
                "id": "card_16comAKUdRrCs1LrjiubpDHY",
                "object": "card",
                "last4": "0341",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 8,
                "exp_year": 2019,
                "fingerprint": "Y1aIepUQrAX0qSGo",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "tokenization_method": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6qVm0p7pJaJHJm"
              },
              "captured": false,
              "balance_transaction": null,
              "failure_message": "Your card was declined.",
              "failure_code": "card_declined",
              "amount_refunded": 0,
              "customer": "cus_6qVm0p7pJaJHJm",
              "invoice": null,
              "description": "Myflix Monthly Charge",
              "dispute": null,
              "metadata": {},
              "statement_descriptor": "Myflix Monthly Charge",
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "destination": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_16comgKUdRrCs1Lr9jM7FUvO/refunds",
                "data": []
              }
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "req_6qVoItLhThONJi",
          "api_version": "2015-07-28"
        }
    http_version: 
  recorded_at: Sun, 23 Aug 2015 04:07:07 GMT
recorded_with: VCR 2.9.3
